// Задача 34: Задайте массив 
// 1. заполненный случайными положительными трёхзначными числами. 
// 2. Напишите программу, которая покажет количество чётных чисел в массиве.
// [345, 897, 568, 234] -> 2

Console.WriteLine("Введите размер массива");
int num = Convert.ToInt32(Console.ReadLine());

int[] AddArrayRnd(int amount)
{
    int[] array = new int[amount];
    Random rnd = new Random();
    for (int i = 0; i < array.Length; i++)
    {
        array[i] = rnd.Next(100, 1000);
    }
    return array;
}

void PrintArray(int[] array)
{
    Console.Write("[");
    for (int i = 0; i < array.Length; i++)
    {
        if (i < array.Length - 1) System.Console.Write($"{array[i]},");
        else Console.Write($"{array[i]}");
    }
    Console.WriteLine("]");
}

int EvenNumberOfArray(int[] array)
{
    int count = 0;
    for (int i = 0; i < array.Length; i++)
    {
        if (array[i]%2 == 0)
        count++;
    }
    return count;
} 

int[] rndArray = AddArrayRnd(num);
int result = EvenNumberOfArray(rndArray);

PrintArray(rndArray);
Console.WriteLine($"Количество четных чисел в данном массиве => {result}");